#### BuiltInFailures.ForeignFileFailures Members

---

|  |
| --- |
| BuiltInFailures ForeignFileFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ForeignFileFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ForeignFile | This file [FamilyName] was saved by an application that was not developed or licensed by Autodesk. |
| Public property Static member | ForeignLink | This file [RvtLinkName] was saved by an application that was not developed or licensed by Autodesk. |

# See Also

BuiltInFailures ForeignFileFailures Class

Autodesk.Revit.DB Namespace